---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.ArgumentsInconsistentException
source: html/81523339-452d-15e7-8690-7da591218001.htm
---
# ArgumentsInconsistentException Methods

Retrieves data needed to serialize the target object.